hey @justinretzolk having difficulties with it allowing two `string_equals`

**Terraform plan**

```
  # module.REMOVED_aws_backup.aws_backup_selection.ab_selection[0] will be created
  + resource "aws_backup_selection" "ab_selection" {
      + iam_role_arn = (known after apply)
      + id           = (known after apply)
      + name         = "iac"
      + plan_id      = (known after apply)
      + resources    = [
          + "arn:aws:ec2:*:*:instance/*",
        ]

      + condition {
          + string_equals {
              + key   = "aws:ResourceTag/Backup"
              + value = "true"
            }
        }
      + condition {
          + string_equals {
              + key   = "aws:ResourceTag/Project"
              + value = "REMOVED"
            }
        }
    }
```

**Cloudtrail**

```
    "requestParameters": {
        "backupPlanId": "REMOVED",
        "backupSelection": {
            "selectionName": "iac",
            "iamRoleArn": "arn:aws:iam::REMOVED:role/aws-backup-plan-REMOVED-tags-based-plan-role",
            "resources": [
                "arn:aws:ec2:*:*:instance/*"
            ],
            "listOfTags": [],
            "notResources": [],
            "conditions": {
                "stringEquals": [
                    {
                        "conditionKey": "aws:ResourceTag/Backup",
                        "conditionValue": "true"
                    }
                ]
            }
        }
    },
```

**Tag equals** does show up but only one condition

![image](https://user-images.githubusercontent.com/2676701/149538927-c00b8818-54c6-431b-b1ea-e1fd0e12d1ba.png)

When re-running plan:

```
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # module.REMOVED_aws_backup.aws_backup_selection.ab_selection[0] has been changed
  ~ resource "aws_backup_selection" "ab_selection" {
        id            = "REMOVED"
        name          = "iac"
      + not_resources = []
        # (3 unchanged attributes hidden)

      - condition {
          - string_equals {
              - key   = "aws:ResourceTag/Project" -> null
              - value = "REMOVED" -> null
            }
        }
        # (1 unchanged block hidden)
    }
  # module.REMOVED_aws_backup.aws_iam_policy.ab_tag_policy[0] has been changed
  ~ resource "aws_iam_policy" "ab_tag_policy" {
        id          = "arn:aws:iam::REMOVED:policy/aws-backup-plan-REMOVED-tags-based-plan-role"
        name        = "aws-backup-plan-REMOVED-tags-based-plan-role"
      + tags        = {}
        # (6 unchanged attributes hidden)
    }
  # module.REMOVED_aws_backup.aws_iam_role.ab_role[0] has been changed
  ~ resource "aws_iam_role" "ab_role" {
        id                    = "aws-backup-plan-REMOVED-tags-based-plan-role"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::REMOVED:policy/aws-backup-plan-REMOVED-tags-based-plan-role",
          + "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup",
          + "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForRestores",
        ]
        name                  = "aws-backup-plan-REMOVED-tags-based-plan-role"
        tags                  = {
            "Backup"                   = "true"
            "Project"                  = "REMOVED"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.



Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.REMOVED_aws_backup.aws_backup_selection.ab_selection[0] must be replaced
-/+ resource "aws_backup_selection" "ab_selection" {
      ~ id            = "REMOVED" -> (known after apply)
        name          = "iac"
      - not_resources = [] -> null
        # (3 unchanged attributes hidden)

      + condition { # forces replacement
          + string_equals {
              + key   = "aws:ResourceTag/Project"
              + value = "REMOVED"
            }
        }
        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```